cases/simple_cht_test/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   0.001;  // mm to m

vertices
(
    // Solid region (bottom)
    (0 0 0)       // 0
    (100 0 0)     // 1
    (100 10 0)    // 2
    (0 10 0)      // 3
    (0 0 10)      // 4
    (100 0 10)    // 5
    (100 10 10)   // 6
    (0 10 10)     // 7

    // Fluid region (top)
    (0 10 0)      // 8 = 3
    (100 10 0)    // 9 = 2
    (100 30 0)    // 10
    (0 30 0)      // 11
    (0 10 10)     // 12 = 7
    (100 10 10)   // 13 = 6
    (100 30 10)   // 14
    (0 30 10)     // 15
);

blocks
(
    // Solid block
    hex (0 1 2 3 4 5 6 7) solid (20 5 1) simpleGrading (1 1 1)
    // Fluid block
    hex (3 2 10 11 7 6 14 15) fluid (20 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 10 14 6)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (11 15 14 10)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // Solid front/back
            (0 3 2 1)
            (4 5 6 7)
            // Fluid front/back
            (3 11 10 2)
            (7 6 14 15)
        );
    }
    solidSides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);
