cases/simple_cht_test/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionProperties;
}

regions
(
    fluid       (fluid)
    solid       (solid)
);
