cases/simple_cht_test/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 1;

method          simple;

simpleCoeffs
{
    n           (1 1 1);
    delta       0.001;
}
